<?php
/**
 * Created by PhpStorm.
 * User: chenxh
 * Date: 2019/1/30
 * Time: 23:00
 */
return [
    'is_test' => false,
    'default_return_type'    => 'json',
    //
    'api_cache_key'=>[
        'cur_user'=>'curuser:',
        'app_token'=>'gaapitoken:'
    ],

    //进京途径 下拉字段
    'gobeijing_path'=>[
        ['id'=>1,'name'=>'铁路'],
        ['id'=>2,'name'=>'民航'],
        ['id'=>3,'name'=>'自驾车'],
        ['id'=>4,'name'=>'物流车'],
        ['id'=>5,'name'=>'长途客运'],
        ['id'=>6,'name'=>'不详'],
    ],
    'gobeijing_path_kv'=>[
        1=>'铁路',
        2=>'民航',
        3=>'自驾车',
        4=>'物流车',
        5=>'长途客运',
        6=>'不详'
    ],
    //事件数据采集-人数规模处
    'people_nums'=>[
        ['id'=>1,'name'=>'50'],
        ['id'=>2,'name'=>'50-100'],
        ['id'=>3,'name'=>'100-200'],
        ['id'=>4,'name'=>'200以上']
    ],
    'people_nums_kv'=>[
        1=>'50',
        2=>'50-100',
        3=>'100-200',
        4=>'200以上',
    ],
    //在京行办类型
    'acttype_inbeijing'=>[
        ['id'=>1,'name'=>'外围查找'],
        ['id'=>2,'name'=>'北京分流'],
        ['id'=>3,'name'=>'非访登记']
    ],
    'acttype_inbeijing_kv'=>[
        1=>'外围查找',
        2=>'北京分流',
        3=>'非访登记',
    ],
    //信访行为
    'gotype'=>[
        ['id'=>1,'name'=>'进京上访'],
        ['id'=>2,'name'=>'赴省上访'],
        ['id'=>3,'name'=>'到市上访'],
        ['id'=>4,'name'=>'县区上访'],
        ['id'=>5,'name'=>'其他上访'],
    ],
    'gotype_kv'=>[
        1=>'进京上访',
        2=>'赴省上访',
        3=>'到市上访',
        4=>'县区上访',
        5=>'其他上访',
    ],
    //日常性工作-过激行为 下拉字段
    'action_names'=>[
        ['id'=>1,'name'=>'扬言自杀'],
        ['id'=>2,'name'=>'扬言爆炸'],
        ['id'=>3,'name'=>'扬言报复'],
    ],
    'action_names_kv'=>[
        1=>'扬言自杀',
        2=>'扬言爆炸',
        3=>'扬言报复',
    ],
    //事件数据采集-涉及人群处 下拉字段
    'event_groups'=>[
        ['id'=>1,'name'=>'拆迁'],
        ['id'=>2,'name'=>'军队退役人员'],
        ['id'=>3,'name'=>'企业改制'],
        ['id'=>4,'name'=>'投资参与受损'],
        ['id'=>5,'name'=>'涉法涉诉'],
        ['id'=>6,'name'=>'其他社会面']
    ],
    'event_groups_kv'=>[
        1=>'拆迁',
        2=>'军队退役人员',
        3=>'企业改制',
        4=>'投资参与受损',
        5=>'涉法涉诉',
        6=>'其他社会面'
    ],
    //事件预警信息-事件类别处 下拉字段
    'event_cates'=>[
        ['id'=>1,'name'=>'上访'],
        ['id'=>2,'name'=>'堵塞公共道路\场所'],
        ['id'=>3,'name'=>'罢工/罢运'],
        ['id'=>4,'name'=>'极端行为'],
    ],
    'event_cates_kv'=>[
        1=>'上访',
        2=>'堵塞公共道路\场所',
        3=>'罢工/罢运',
        4=>'极端行为',
    ],
    //进京方式
    'gobeijing_types'=>[
        ['id'=>1,'name'=>'直达'],
        ['id'=>2,'name'=>'绕道'],
    ],
    'gobeijing_types_kv'=>[
        1=>'直达',
        2=>'绕道',
    ],
    //绕道
    'raodaos'=>[
        ['id'=>1,'name'=>'上海'],
        ['id'=>2,'name'=>'河北'],
        ['id'=>3,'name'=>'河南'],
        ['id'=>4,'name'=>'内蒙古'],
        ['id'=>5,'name'=>'辽宁'],
        ['id'=>6,'name'=>'山东'],
        ['id'=>7,'name'=>'其他']
    ],
    'raodaos_kv'=>[
        1=>'上海',
        2=>'河北',
        3=>'河南',
        4=>'内蒙古',
        5=>'辽宁',
        6=>'山东',
        7=>'其他',
    ],
    //信访诉求类型
    'suqiu_types'=>[
        ['id'=>1,'name'=>'涉拆迁'],
        ['id'=>2,'name'=>'军队退役人员'],
        ['id'=>3,'name'=>'企业改制'],
        ['id'=>4,'name'=>'投资参与受损'],
        ['id'=>5,'name'=>'涉法涉诉'],
        ['id'=>6,'name'=>'楼盘物业'],
        ['id'=>7,'name'=>'其他'],
    ],
    'suqiu_types_kv'=>[
        1=>'涉拆迁',
        2=>'军队退役人员',
        3=>'企业改制',
        4=>'投资参与受损',
        5=>'涉法涉诉',
        6=>'楼盘物业',
        7=>'其他'
    ],
    'xinfang_cate'=>[
        ['id'=>1,'name'=>'个访'],
        ['id'=>2,'name'=>'集访，同行人员'],
    ],
    //信访行为
//    'xinfang_types'=>[
//        ['id'=>1,'name'=>'进京上访'],
//        ['id'=>2,'name'=>'赴省上访'],
//        ['id'=>3,'name'=>'到市上访'],
//        ['id'=>4,'name'=>'县区上访'],
//        ['id'=>5,'name'=>'其他上访'],
//    ],
//    'xinfang_types_kv'=>[
//        1=>'进京上访',
//        2=>'赴省上访',
//        3=>'到市上访',
//        4=>'县区上访',
//        5=>'其他上访',
//    ],
//    进京行为类型
//    'gobeijing_acts'=>[
//        ['id'=>1,'name'=>'外围查找'],
//        ['id'=>2,'name'=>'北京分流'],
//        ['id'=>3,'name'=>'非访登记']
//    ],
//    'gobeijing_acts_kv'=>[
//        1=>'外围查找',
//        2=>'北京分流',
//        3=>'非访登记',
//    ],
    //role
    'role'=>[
        1=>'超级用户',//超级用户,对所有数据均可添，删，改查
        2=>'浏览权限用户',//浏览权限用户，可查看所有账号上传的内容。不能进行删除和重新编辑，仅支持浏览。
        3=>'个人权限用户'//个人权限账号：查看本账号所上传的内容。可以进行删除和重新编辑
    ]
];